import React from 'react';
import {
  Avatar,
  Card,
  CardContent,
  CardHeader,
  Grid,
  Hidden,
  IconButton,
  List,
  ListItem,
  ListItemIcon,
  ListItemText,
  Paper,
  Typography
} from '@material-ui/core';
import {BarChart, ChevronRight, Settings, SettingsInputAntenna, Wallpaper} from '@material-ui/icons'
import Container from "@material-ui/core/Container";
import {Link} from "react-router-dom";
import MaterialTable from "material-table";

export const EducationProfileCard = props => {
  return (
    <Card className={'education-profiles'}>
      <CardHeader
        classes={{root: 'education-profiles-header'}}
        avatar={
          <Avatar aria-label="recipe" className={'education-profiles-avatar'}>
            <IconButton aria-label="settings">
              {props.icon}
            </IconButton>
          </Avatar>
        }
        title={props.name}
      />
      <div
        className={'education-profiles-picture'}
        style={{backgroundImage: `url(${props.background})`}}
      />
      <CardContent classes={{root: 'education-profiles-description'}}>
        <List component="nav">
          {props.list.map((item, index) => {
            return (
              <Link to={item.path} key={index}>
                <ListItem button classes={{root: 'whiteColor'}}>
                  <ListItemIcon classes={{root: 'whiteColor'}}>
                    <ChevronRight/>
                  </ListItemIcon>
                  <ListItemText primary={item.name}/>
                </ListItem>
              </Link>
            )
          })}
        </List>
      </CardContent>
    </Card>
  );
}

export const EducationProfileView = props => (
  <Container maxWidth={'xl'} disableGutters={true} classes={{root: 'stats'}}>
    <Container maxWidth={'xl'}>
      {props.showTitle ?
        <Typography classes={{root: 'education-profiles-title'}} variant={'h3'} align={'center'}>Образовни
          профили</Typography>
        : null}
      <Grid container spacing={3}>
        {EducationProfileList.map((item, index) => {
          return (
            <Grid item xs={12} lg={3} md={6}>
              <EducationProfileCard key={index} {...item} />
            </Grid>
          )
        })}
      </Grid>
    </Container>
  </Container>
)

export const EducationProfileSinglePage = props => {
  return (
    <Container maxWidth={'xl'} disableGutters={true} classes={{root: 'education-profiles-singlePage'}}>
      <div className={'education-profiles-singlePage-picture'} style={{backgroundImage: `url(${props.background})`}}/>
      <Container maxWidth={'lg'} classes={{root: 'education-profiles-singlePage-content'}}>
        <Typography classes={{root: 'education-profiles-singlePage-content-title'}} variant={'h5'}>{props.name}</Typography>
        <Grid container spacing={3}>
          <Grid item xs={12} md={9}>
            {props.details ?
              <Typography classes={{root: 'education-profiles-singlePage-content-text'}} variant={'h6'} dangerouslySetInnerHTML={{__html: props.details}} /> : null}
            {props.pageContent.intro ?
              <Typography classes={{root: 'education-profiles-singlePage-content-text'}} variant={'h6'}>{props.pageContent.intro}</Typography>
              : null}
            <List component="nav">
              {props.pageContent.list?.map((item, index) => {
                return (
                  <ListItem key={index} button classes={{root: 'whiteColor'}}>
                    <ListItemIcon classes={{root: 'whiteColor'}}>
                      <ChevronRight/>
                    </ListItemIcon>
                    <ListItemText classes={{root: 'firstWord'}} primary={item.item}/>
                  </ListItem>
                )
              })}
            </List>
            {props.pageContent.otherText ?
              <Typography classes={{root: 'education-profiles-singlePage-content-text'}} variant={'h6'} dangerouslySetInnerHTML={{__html: props.pageContent.otherText}}/> : null}
            {props.pageContent.table ?
              <EducationProfileTable data={props.pageContent.table.rows} columns={props.pageContent.table.columns} title={props.name}/> : null}
          </Grid>
          <Hidden smDown>
            <Grid item md={3}>
              <Paper elevation={3} classes={{root: 'education-profiles-singlePage-profiles-list'}}>
                <div className={'title'}>Образовни профили</div>
                <Paper classes={{root: 'quicklinks'}}>
                  <List component="nav" aria-label="main mailbox folders">
                    {EducationProfileSubList.map((item, i) => {
                      return (
                        <Link key={i} to={item.path}>
                          <ListItem button classes={{root: 'blackColor'}}>
                            <ListItemIcon classes={{root: 'blackColor'}}>
                              <ChevronRight/>
                            </ListItemIcon>
                            <ListItemText primary={item.name}/>
                          </ListItem>
                        </Link>
                      )
                    })}
                  </List>
                </Paper>
              </Paper>
            </Grid>
          </Hidden>
        </Grid>
      </Container>
    </Container>
  )
}


const EducationProfileTable = props => {
  return (
    <MaterialTable title={`${props.title} - Стручни предмети`}
                   columns={props.columns}
                   data={props.data}
                   options={{
                     search: false,
                     paging: false,
                   }}
    />
  );
}


export const EducationProfileList = [
  {
    name      : 'Геологија, рударство и металургија',
    background: '/images/obrazovni-profili/rudarstvo.jpg',
    icon      : <Wallpaper/>,
    to        : '/geologija-rudarstvo-metalurgija',
    list      : [
      {
        name   : 'Руковалац механизацијом у површинској експлоатацији',
        details: 'Руковалац механизацијом у површинској експлоатацији рукује машинама (багерима, булдожерима, ровокопачима, скреперима, грејдерима, киперима, средствима шинског транспорта, транспортнним тракама, сепараторима, дробилицама) за откоп, утовар, истовар и транспорт материјала.',
        path   : '/rukovodilac-mehanizacijom',
      },
      {
        name   : 'Рударски техничар',
        details: 'Да би био остварен неометан рад термоелектрана и да би производња електричне енергије текла неометано мора се остварити потпуна производња угља на површинским коповима. Кључну улогу у функционисању површинског копа имају стручњаци рударства. Школовање за рударског техничара траје четири године и у том периоду се ученици оспособљавају за организацију послова у директној производњи. Са завршеним школовањем за рударског тахничара и положеним матурским испитом добија се диплома РУДАРСКОГ ТЕХНИЧАРА.',
        path   : '/rudarski-tehnicar',
      },
    ]
  },
  {
    name      : 'Машинство и обрада метала',
    background: '/images/obrazovni-profili/masinskaobradametala.jpg',
    icon      : <Settings/>,
    to        : '/masinstvo-i-obrada-metala',
    list      : [
      {
        name   : 'Бравар – заваривач',
        details: 'Постављени образовни циљ је да успешно обучен машински техничар ове струке стекне потребна знања о материјалима који се користе у машинсву, савременим поступцима заваривања и другим начинима спајања материјала, избору материјала за спајање, методама контроле исправности делова, проналажењу грешака и најбољих начина за поправку – репарацију, као и знања о рачунарима и програмима AutoCAD и Solid Works које може да користи при дизајнирању оштећеног дела и његовој поправци. Школа планира да машинском техничару за репаратуру, по завршеној школи, пружи могућност полагања испита из заваривања и других начина спајања материјала и да тако добије атест заваривача. Уз проходност овог смера на више школе и факултете, као и бројне могућности запошљавања очекује се да овај смер привуче велики број нових ученика.',
        path   : '/bravar-zavarivac',
      },
      {
        name   : 'Техничар за компјутерско управљање (CNC) машина',
        details: 'Техничар за комјутерско управљање (CNC) машина је занимање будућности. Повезује познавање опште машинских знања, са познавањем технологија обраде на компјутерски управљаним струговима и глодалицама. Уз примену знања и вештина рада на рачунару, научићете да направите програм по којем ће КУМ - компјутерски управљане машине (или цнц машине) производити тражени радни део. Зато се са правом каже, да техничар за комјутерско управљање (CNC) машина, чини да машта постане стварност.',
        path   : '/tehnicar-za-kompjutersko-upravljanje-cnc-masina',
      },
    ]
  },
  {
    name      : 'Економија, право и администрација',
    background: '/images/obrazovni-profili/ekonomija.jpg',
    icon      : <BarChart/>,
    to        : '/ekonomija-pravo-administracija',
    list      : [
      {
        name   : 'Економски техничар',
        details: 'Да би био остварен неометан рад термоелектрана и да би производња електричне енергије текла неометано мора се остварити потпуна производња угља на површинским коповима. Кључну улогу у функционисању површинског копа имају стручњаци рударства. Школовање за рударског техничара траје четири године и у том периоду се ученици оспособљавају за организацију послова у директној производњи. Са завршеним школовањем за рударског тахничара и положеним матурским испитом добија се диплома РУДАРСКОГ ТЕХНИЧАРА.',
        path   : '/ekonomski-tehnicar',
      },
      {
        name   : 'Финансијско - рачуноводствени техничар',
        details: 'Да би био остварен неометан рад термоелектрана и да би производња електричне енергије текла неометано мора се остварити потпуна производња угља на површинским коповима. Кључну улогу у функционисању површинског копа имају стручњаци рударства. Школовање за рударског техничара траје четири године и у том периоду се ученици оспособљавају за организацију послова у директној производњи. Са завршеним школовањем за рударског тахничара и положеним матурским испитом добија се диплома РУДАРСКОГ ТЕХНИЧАРА.',
        path   : '/finansijsko-racunovodstveni-tehnicar',
      },
    ]
  },
  {
    name      : 'Електротехника',
    background: '/images/obrazovni-profili/elektronika.jpg',
    icon      : <SettingsInputAntenna/>,
    to        : '/elektrotehnika',
    list      : [
      {
        name   : 'Техничар мехатронике',
        details: 'Да би био остварен неометан рад термоелектрана и да би производња електричне енергије текла неометано мора се остварити потпуна производња угља на површинским коповима. Кључну улогу у функционисању површинског копа имају стручњаци рударства. Школовање за рударског техничара траје четири године и у том периоду се ученици оспособљавају за организацију послова у директној производњи. Са завршеним школовањем за рударског тахничара и положеним матурским испитом добија се диплома РУДАРСКОГ ТЕХНИЧАРА.',
        path   : '/tehnicar-mehatronike',
      },
      {
        name   : 'Аутоелектричар и Електричар',
        details: 'Да би био остварен неометан рад термоелектрана и да би производња електричне енергије текла неометано мора се остварити потпуна производња угља на површинским коповима. Кључну улогу у функционисању површинског копа имају стручњаци рударства. Школовање за рударског техничара траје четири године и у том периоду се ученици оспособљавају за организацију послова у директној производњи. Са завршеним школовањем за рударског тахничара и положеним матурским испитом добија се диплома РУДАРСКОГ ТЕХНИЧАРА.',
        path   : '/autoelektricar-i-elektricar',
      },
      {
        name   : 'Електротехничар рачунара',
        details: 'Да би био остварен неометан рад термоелектрана и да би производња електричне енергије текла неометано мора се остварити потпуна производња угља на површинским коповима. Кључну улогу у функционисању површинског копа имају стручњаци рударства. Школовање за рударског техничара траје четири године и у том периоду се ученици оспособљавају за организацију послова у директној производњи. Са завршеним школовањем за рударског тахничара и положеним матурским испитом добија се диплома РУДАРСКОГ ТЕХНИЧАРА.',
        path   : '/elektrotehnicar-racunara',
      },
      {
        name   : 'Електротехничар процесног управљања',
        details: 'Да би био остварен неометан рад термоелектрана и да би производња електричне енергије текла неометано мора се остварити потпуна производња угља на површинским коповима. Кључну улогу у функционисању површинског копа имају стручњаци рударства. Школовање за рударског техничара траје четири године и у том периоду се ученици оспособљавају за организацију послова у директној производњи. Са завршеним школовањем за рударског тахничара и положеним матурским испитом добија се диплома РУДАРСКОГ ТЕХНИЧАРА.',
        path   : '/elektrotehnicar-procesnog-upravljanja',
      },
    ]
  },
]

export const EducationProfileSubList = [
  {
    name       : 'Руковалац механизацијом у површинској експлоатацији',
    background : '/images/obrazovni-profili/rukovodilac-mehanizacijom.jpeg',
    details    : 'Руковалац механизацијом у површинској експлоатацији рукује машинама (багерима, булдожерима, ровокопачима, скреперима, грејдерима, киперима, средствима шинског транспорта, транспортнним тракама, сепараторима, дробилицама) за откоп, утовар, истовар и транспорт материјала.',
    pageContent: {
      intro    : 'Занимања којима се може бавити руковалац механизацијом у површинској експлоатацији:',
      list     : [
        {item: 'Руковалац опреме за бушење у подземној експлоатацији'},
        {item: 'Руковалац багера циличног деловања'},
        {item: 'Руковалац рударским тешким возилима'},
        {item: 'Руковалац једноставном рударском механизацијом'}
      ],
      otherText: 'Руковалац механизацијом у површинској експлоатацији рукује машинама (багерима, булдожерима, ровокопачима, скреперима, грејдерима, киперима, средствима шинског транспорта, транспортнним тракама, сепараторима, дробилицама) за откоп, утовар, истовар и транспорт материјала. Осим непосредног утовара руда и истовара допремљеног материјала, бави се и утврђивањем исправности радилишта, рашчишћавањем терена за минирање, физичким обезбеђивањем минског поља у свим фазама минирања, као и уситњавањем већих блокова. Такође, води рачуна о одржавању машина, проверава њихов рад, њихову исправност и отклања мање кварове. Прегледа терен и зону рада механизације. ',
    },
    path       : '/rukovodilac-mehanizacijom',
  },
  {
    name       : 'Рударски техничар',
    background : '/images/obrazovni-profili/rudarski-tehnicar.jpg',
    details    : 'Да би био остварен неометан рад термоелектрана и да би производња електричне енергије текла неометано мора се остварити потпуна производња угља на површинским коповима. Кључну улогу у функционисању површинског копа имају стручњаци рударства. Школовање за рударског техничара траје четири године и у том периоду се ученици оспособљавају за организацију послова у директној производњи. Са завршеним школовањем за рударског тахничара и положеним матурским испитом добија се диплома РУДАРСКОГ ТЕХНИЧАРА.',
    pageContent: {
      intro    : 'Рударски техничари на површинском копу обављају послове као што су вођа групе или бригадири и директно утичу на организовању следећих послова:',
      list     : [
        {item: 'пројектовање површинског копа'},
        {item: 'пројектовање и израда путева'},
        {item: 'прорачун бушотина за минирање'},
        {item: 'рударско мерење у површинским коповима'},
        {item: 'пројектовање и израда плана производње на површинским коповима'}
      ],
      otherText: 'Да би био остварен неометан рад термоелектрана и да би производња електричне енергије текла неометано мора се остварити потпуна производња угља на површинским коповима. Кључну улогу у функционисању површинског копа имају стручњаци рударства. Школовање за рударског техничара траје четири године и у том периоду се ученици оспособљавају за организацију послова у директној производњи. Са завршеним школовањем за рударског тахничара и положеним матурским испитом добија се диплома РУДАРСКОГ ТЕХНИЧАРА. Наставак школовања је могућ на било ком техничком факултету јер је у четворогодишњем школовању стечена правилна основа за упис било ког техничког факултета а на првом месту РУДАРСКО-ГЕОЛОШКОГ факултета у Београду.',
    },
    path       : '/rudarski-tehnicar',
  },
  {
    name: 'Бравар – заваривач',
    background : '/images/obrazovni-profili/masinski-tehnicar-za-reparaturu.png',
    details    : '',
    pageContent: {
      intro    : 'За бравара – заваривача је поред теорије веома важна и стручна пракса. Бравар заваривач:',
      list     : [
        {item: 'планира, припрема и организује браварске и завариваче радове'},
        {item: 'израђује делове металних конструкција механичком обрадом'},
        {item: 'спаја делове металних конструкција раздвојивим и нераздвојивим спојевима'},
        {item: 'израђује и монтира металне конструкције и процесну опрему'},
        {item: 'контролише квалитет браварских радова према прописима и нормативима'},
        {item: 'врши заваривање поступком електролучног (РЕЛ, МИГ, МАГ, ТИГ) и електроотпорног заваривања'},
        {item: 'врши заваривање поступком гасног заваривања'},
        {item: 'спаја делове меким и тврдим лемљењем и лепљењем'},
        {item: 'контролише квалитета рада при заваривању'},
        {item: 'брине се о очувању здравља, околине и безбедности на раду при извођењу браварских и заваривачких радова'},
      ],
      otherText: '',
    },
    path       : '/bravar-zavarivac',
  },
  {
    name       : 'Техничар за компјутерско управљање (CNC) машина',
    background : '/images/obrazovni-profili/tehnicar-za-kompjutersko-upravljanje-cnc-masina.jpg',
    details    : 'Техничар за комјутерско управљање (CNC) машина је занимање будућности. Повезује познавање опште машинских знања, са познавањем технологија обраде на компјутерски управљаним струговима и глодалицама. Уз примену знања и вештина рада на рачунару, научићете да направите програм по којем ће КУМ - компјутерски управљане машине (или цнц машине) производити тражени радни део. Зато се са правом каже, да техничар за комјутерско управљање (CNC) машина, чини да машта постане стварност.',
    pageContent: {
      intro    : 'Током четворогодишњег програма ученици ће бити оспособљени за:',
      list     : [
        {item: 'правилну израду и коришћење техничке документације'},
        {item: 'за процес организације рада на CNC машинама'},
        {item: 'за разраду технолошких поступака обраде на КУМ машинама'},
        {item: 'за примену алата и прибора у процесу производње'},
        {item: 'за примену аутоматизације у процесу производње'},
        {item: 'за стицање знања о структури флексибилних аутоматизованих система'},
        {item: 'за примену различитих мерних метода које се користе у техничкој и метролошкој пракси'},
        {item: 'за активно коришћење рачунара приликом израде техничко-технолошке документације'},
        {item: 'за процес програмирања (G-кода) на компјутерски управљаним машинама, као и уношење и тестирање програма'},
      ],
      otherText: 'Техничар за компјутерско управљање (CNC) машина је занимање будућности. Повезује познавање опште машинских знања, са познавањем технологија обраде на компјутерски управљаним струговима и глодалицама. Уз примену знања и вештина рада на рачунару, научићете да направите програм по којем ће КУМ - компјутерски управљане машине (или CNC машине) производити тражени радни део. Зато се са правом каже, да техничар за компјутерско управљање (CNC) машина, чини да машта постане стварност.',
    },
    path       : '/tehnicar-za-kompjutersko-upravljanje-cnc-masina',
  },
  {
    name       : 'Економски техничар',
    background : '/images/obrazovni-profili/ekonomski-tehnicar.jpg',
    pageContent: {
      intro    : 'Економија као подручје рада у којем се образују економски техничари омогућава задовољавање интересовања ученика који су наклоњени проучавању друштвених наука. Изучавајући групу економских предмета поред опште-образовних, наши ученици стичу знања о економији као теорији и примењеној економији.',
      otherText: 'Наставним програмом за образовни профил економски техничар предвиђени су предмети којима се стичу неопходна стручна знања из економије, организације и менаџмента предузећа. Такође се кроз разне опште образовне предмете стичу општа знања и општа култура.<br/> По завршетку четворогодишњег школовања и стицањем звања економског техничара, ученици имају могућност да наставе школовање на вишим и високим школама или да се запосле у многим гранама привреде (у банци, у осигурању, у трговачким, туристичким и угоститељским предузећима...), а послови на којима економски техничар може да ради су послови у области књиговодства, рачуноводства, финансија, благајнички послови, послови економске пропаганде и сл.<br/> На радним местима на којима се запошљавају економиски техничари, већина послова се обавља на рачунарима, за шта се оспособљавају кроз програм пословне информатике у средњој школи.',
    },
    path       : '/ekonomski-tehnicar',
  },
  {
    name       : 'Финансијско - рачуноводствени техничар',
    background : '/images/obrazovni-profili/finansijski-tehnicar.jpeg',
    details    : 'Финансијско-рачуноводствени техничар обавља финансијско – рачуноводствене послове, саставља и презентује финансијске и пореске извештаје.',
    pageContent: {
      intro    : 'По завршетку школовања ученик стиче следеће стручне компетенције:',
      list     : [
        {item: 'Организовање сопственог рада у области финансија и рачуноводства'},
        {item: 'Обављање послова са књиговодственом документацијом'},
        {item: 'Обављање послова платног промета'},
        {item: 'Контирање и књижење пословних промена кроз пословне књиге'},
        {item: 'Обављање финансијских послова'},
        {item: 'Припремање и израда обрачуна'},
        {item: 'Припремање и израда извештаја'},
      ],
      otherText: 'На овом образовном профилу ученици стичу практичне вештине радећи у виртуелним привредним друштвима која оснивају у оквиру предмета финансијско – рачуноводствена обука. <br/> У другом, трећем и четвртом разреду ученици имају прилику да обављају праксу у реалним привредним друштвима, књиговодственим агенцијама, предузетничким радњама и на тај начин у пракси проверавају стечена знања у школи. <br/> Од другог разреда ученици имају предмет Финансијско – рачуноводствена обука која се одвија у специјализованим учионицама – бироима, који су опремљени као и свака канцеларија у привредном друштву. Кроз овај предмет ученици стичу најшира практична знања из области оснивања привредних друштава, финанијско-рачуноводствених послова и послова платног промета. <br/> Након завршеног средњег образовања, финансијско рачуноводствени техничари могу да се запосле у финансијско – рачуноводственим службама свих привредних друштава, у банкама, осигуравајућим организацијама, књиговодственим агенцијама...',
    },
    path       : '/finansijsko-racunovodstveni-tehnicar',
  },
  {
    name       : 'Техничар мехатронике',
    background : '/images/obrazovni-profili/elektromonter-mreza-i-postrojenja.jpeg',
    details    : 'Образовни профил Техничар мехатронике оспособљава ученике за рад у једној од веома тражених области данашњице. Мехатроника је дисциплина која представља савршени спој машинства, електротехнике, аутоматике, програмирања и информационих технологија. <br/> Циљ стручног образовања за квалификацију ТЕХНИЧАР МЕХАТРОНИКЕ је оспособљавање лица за монтирање компонената, дијагностиковање кварова, поправка и одржавање опреме и мехатронских уређаја и система.',
    pageContent: {
      intro    : 'Након завршеног средњег образовања, техничар мехатронике ће бити у стању да:',
      list     : [
        {item: 'учествује у изради пројектно-технолошке документације'},
        {item: 'монтира компоненте мехатронских уређаја и система'},
        {item: 'дијагностикује кварове мехатронских уређаја и система'},
        {item: 'поправља кварове мехатронских уређаја и система'},
        {item: 'одржава мехатронску опрему'},
        {item: 'обавља административне послове'},
      ],
    },
    path       : '/tehnicar-mehatronike',
  },
  {
    name       : 'Аутоелектричар и Електричар',
    background : '/images/obrazovni-profili/autoelektricar.jpg',
    details    : 'Аутоелектричари одржавају електричне и електронске уређаје и инсталације у аутомобилу, монтирају и демонтирају расвету аутомобила и регулишу паљење. Дијагностикују квар на електронској опреми аутомобила и отклањају га заменом електронског склопа. Пошто модерни аутомобили имају све више електронски регулисаних функција, примена основних знања електротехнике и електронике на електричне и електронске уређаје у аутомобилу кључна је у овом занимању.',
    pageContent: {
      otherText: 'Аутоелектричари познају принцип рада електронских система и њихов је посао замена таквих система новима. Електрични уређаји које поправљају и монтирају су светла и комплетна саобраћајна сигнализација и електрични склоп паљења аутомобила. Поред препознавање електронских кварова, оспособљени су и за испитивање и замену електронских компоненти. <br/> Предвиђа се да ће убудуће у аутомобилима бити све више електронике, тако да је непрестано учење нових технологија важан део занимања. <br/> У оквиру образовног профила Електричар, ученици стичу знања из области пројектовања и извођења електричних инсталација. <br/> Такође се стичу знања везана за одржавање и поправку електричних кућних апарата и уређаја. <br/> У овој школској години уписујемо једно одељење од 28 ученика - 14 ученика образовни профил Аутоелектричар и 14 ученика образовни профил Електричар.',
    },
    path       : '/autoelektricar-i-elektricar',
  },
  {
    name       : 'Електротехничар рачунара',
    background : '/images/obrazovni-profili/elektrotehnicar-racunara.jpg',
    details    : 'Бави се претежно хардверским делом рачунара. Ту спада одржавање и сервисирање рачунара, опреме и рачунарских система. Поправља кварове, мења делове, саставља нове рачунаре и раставља старе. Проверава рад компоненти и набавља нове (процесор, графичка картица, кулер, матична плоча, хард диск и слично.) Поред хардвера, такође ради и на софтверу, у шта спада инсталација оперативних система, разних врста програма, одржавање интернета, као и друге врсте подешавања. Будући да је свет рачунара веома динамичан и обележен честим променама, неопходно је пратити нове трендове и примењивати их у струци.',
    pageContent: {
      intro    : 'Волите ли рачунаре? Данас сви мисле да о рачунарима знају све. Ми мислимо да то није баш тако. Код нас: учите о рачунарима оно што други не знају, проучавате рачунаре кроз низ занимљивих предмета, користите рачунаре на часовима у лабораторијама и кабинетима, примењујете рачунаре у стручним предметима, одлучујете о учешћу на наградним конкурсима из области примене рачунара.',
      otherText: 'Научићете да изаберете или препоручите другима праву рачунарску конфигурацију, инсталирате разне оперативне системе, користите или пројектујете базе података за различите намене, стечена знања из других предмета примените или проверите кроз симулационе програме, рачунар искористите као моћан алат у решавању сложених задатака... Када будете спремни да кренете даље, сазнаћете шта значе скраћенице: ЕТФ, ПМФ, ФОН, РАФ, ФИТ, јер тамо наставља школовање велики број ђака који завршава овај образовни профил. Можда се радије одлучите за продају или сервис и одржавање рачунара и компонената, рад у малим или великим фирмама које све више користе рачунаре... Шта год изабрали, имајте у виду да рачунари и интернет одавно бришу просторне и вренске границе и отварају пут у сигурну будућност.',
    },
    path       : '/elektrotehnicar-racunara',
  },
  {
    name       : 'Електротехничар процесног управљања',
    background : '/images/obrazovni-profili/elektrotehnicar-procesnog-upravljanja.png',
    details    : 'Електротехничар процесног управљања програмира рачунаре да управљању процесима као што су грејање и хлађење, рад сигурносних и алармних уређаја, рад семафора, контрола и паковање производа, изазивање сценских ефеката итд. Ови системи се примењују у многим областима производње, контроле, надзора и одржавања. То су на пример електропривреда, погони у индустријској производњи, разни објекти за регулисање и контролу саобраћаја, медицинске установе, установе културе и забаве, хотели итд. Програмирају и микрорачунаре уграђене у различите дисплеје, билборде, камере, мобилне телефоне, алате и друге уређаје. Потребно је да добро познаје и примењује електротехнику и најсавременија техничка достигнућа из електронике, рачунарске технике, аутоматског управљања и регулације за рад у свим гранама привреде.',
    pageContent: {
      otherText: 'Смер процесног управљања обухвата следеће области које се изучавају током школовања: електроника и енергетска електроника, електричне машине и постројења, електричне инсталације, елементи аутоматизације и аутоматског управљања, микроконтролери, програмабилни логички контролери, рачунарско управљање и програмирање, управљање електричним погонима, примена рачунара. Прве две године изучавају се општи предмети и група општестручних предмета (основе електротехнике, електроника, примена рачунара). Трећа и четврта година се састоји од ускостручних предмета, подељених на теоријске часове и практични део. У практичном делу организују се лабораторијске вежбе а предвиђена је и блок-настава, где се по потреби организују посете фирмама или предузећима која користе елементе процесног управљања.',
    },
    path       : '/elektrotehnicar-procesnog-upravljanja',
  },
]

